#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SM_Shuttle

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SM_Shuttle.BP_SM_Shuttle_C
// 0x0020 (0x0240 - 0x0220)
class ABP_SM_Shuttle_C final : public AActor
{
public:
	class UNiagaraComponent*                      NS_IntroShuttleEngine1;                            // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_IntroShuttleEngine;                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Shuttle;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SM_Shuttle_C">();
	}
	static class ABP_SM_Shuttle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SM_Shuttle_C>();
	}
};
static_assert(alignof(ABP_SM_Shuttle_C) == 0x000008, "Wrong alignment on ABP_SM_Shuttle_C");
static_assert(sizeof(ABP_SM_Shuttle_C) == 0x000240, "Wrong size on ABP_SM_Shuttle_C");
static_assert(offsetof(ABP_SM_Shuttle_C, NS_IntroShuttleEngine1) == 0x000220, "Member 'ABP_SM_Shuttle_C::NS_IntroShuttleEngine1' has a wrong offset!");
static_assert(offsetof(ABP_SM_Shuttle_C, NS_IntroShuttleEngine) == 0x000228, "Member 'ABP_SM_Shuttle_C::NS_IntroShuttleEngine' has a wrong offset!");
static_assert(offsetof(ABP_SM_Shuttle_C, SM_Shuttle) == 0x000230, "Member 'ABP_SM_Shuttle_C::SM_Shuttle' has a wrong offset!");
static_assert(offsetof(ABP_SM_Shuttle_C, Scene) == 0x000238, "Member 'ABP_SM_Shuttle_C::Scene' has a wrong offset!");

}

