#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Citadel_EXT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Citadel_EXT.Citadel_EXT_C
// 0x00E8 (0x0308 - 0x0220)
class ACitadel_EXT_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Citadel_Mid;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight8;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight7;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight6;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight5;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight4;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight3;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Citadel_Bottom;                                    // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Citadel_Deck9;                                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   GroveUnderGlowMinus1;                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   GroveUnderGlowMinus4;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   GroveUnderGlowMinus3;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   GroveUnderGlowMinus2;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Grove_ExteriorMinus4;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Grove_ExteriorMinus3;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Grove_ExteriorMinus2;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Grove_ExteriorMinus1;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveMinus4;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveMinus3;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveMinus2;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveMinus1;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Citadel_Deck7;                                     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Citadel;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Citadel_EXT(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Citadel_EXT_C">();
	}
	static class ACitadel_EXT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACitadel_EXT_C>();
	}
};
static_assert(alignof(ACitadel_EXT_C) == 0x000008, "Wrong alignment on ACitadel_EXT_C");
static_assert(sizeof(ACitadel_EXT_C) == 0x000308, "Wrong size on ACitadel_EXT_C");
static_assert(offsetof(ACitadel_EXT_C, UberGraphFrame) == 0x000220, "Member 'ACitadel_EXT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, PointLight) == 0x000228, "Member 'ACitadel_EXT_C::PointLight' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Citadel_Mid) == 0x000230, "Member 'ACitadel_EXT_C::Citadel_Mid' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight8) == 0x000238, "Member 'ACitadel_EXT_C::SpotLight8' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight7) == 0x000240, "Member 'ACitadel_EXT_C::SpotLight7' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight6) == 0x000248, "Member 'ACitadel_EXT_C::SpotLight6' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight5) == 0x000250, "Member 'ACitadel_EXT_C::SpotLight5' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight4) == 0x000258, "Member 'ACitadel_EXT_C::SpotLight4' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight3) == 0x000260, "Member 'ACitadel_EXT_C::SpotLight3' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight2) == 0x000268, "Member 'ACitadel_EXT_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Citadel_Bottom) == 0x000270, "Member 'ACitadel_EXT_C::Citadel_Bottom' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Citadel_Deck9) == 0x000278, "Member 'ACitadel_EXT_C::Citadel_Deck9' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight1) == 0x000280, "Member 'ACitadel_EXT_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, SpotLight) == 0x000288, "Member 'ACitadel_EXT_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveUnderGlowMinus1) == 0x000290, "Member 'ACitadel_EXT_C::GroveUnderGlowMinus1' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveUnderGlowMinus4) == 0x000298, "Member 'ACitadel_EXT_C::GroveUnderGlowMinus4' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveUnderGlowMinus3) == 0x0002A0, "Member 'ACitadel_EXT_C::GroveUnderGlowMinus3' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveUnderGlowMinus2) == 0x0002A8, "Member 'ACitadel_EXT_C::GroveUnderGlowMinus2' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Grove_ExteriorMinus4) == 0x0002B0, "Member 'ACitadel_EXT_C::Grove_ExteriorMinus4' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Grove_ExteriorMinus3) == 0x0002B8, "Member 'ACitadel_EXT_C::Grove_ExteriorMinus3' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Grove_ExteriorMinus2) == 0x0002C0, "Member 'ACitadel_EXT_C::Grove_ExteriorMinus2' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Grove_ExteriorMinus1) == 0x0002C8, "Member 'ACitadel_EXT_C::Grove_ExteriorMinus1' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveMinus4) == 0x0002D0, "Member 'ACitadel_EXT_C::GroveMinus4' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveMinus3) == 0x0002D8, "Member 'ACitadel_EXT_C::GroveMinus3' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveMinus2) == 0x0002E0, "Member 'ACitadel_EXT_C::GroveMinus2' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, GroveMinus1) == 0x0002E8, "Member 'ACitadel_EXT_C::GroveMinus1' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Citadel_Deck7) == 0x0002F0, "Member 'ACitadel_EXT_C::Citadel_Deck7' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, Citadel) == 0x0002F8, "Member 'ACitadel_EXT_C::Citadel' has a wrong offset!");
static_assert(offsetof(ACitadel_EXT_C, DefaultSceneRoot) == 0x000300, "Member 'ACitadel_EXT_C::DefaultSceneRoot' has a wrong offset!");

}

